src/Enums/Scan_ТипыЗаказовНаЗавод/Scan_ТипыЗаказовНаЗавод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ТипыЗаказовНаЗавод</name>
  <enumValues>
    <name>OpenOrder</name>
  </enumValues>
  <enumValues>
    <name>FirmOrderNormal</name>
  </enumValues>
  <enumValues>
    <name>FirmOrderUrgent</name>
  </enumValues>
  <enumValues>
    <name>FirmOrderRefill</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ТипыЗаказовНаЗавод/ManagerModule.bsl
//rarus vikhle 13.09.2021 АПК +++
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив типов заказов Firm
// 
// Возвращаемое значение:
// 	Массив  - массив типов заказов Firm
//
Функция ТипыЗаказаFirm() Экспорт //rarus vikhle 03.09.2021 mt 18212 +++
	
	МассивТиповЗаказаFirm = Новый Массив;
	МассивТиповЗаказаFirm.Добавить(Перечисления.Scan_ТипыЗаказовНаЗавод.FirmOrderNormal);
	МассивТиповЗаказаFirm.Добавить(Перечисления.Scan_ТипыЗаказовНаЗавод.FirmOrderRefill);
	МассивТиповЗаказаFirm.Добавить(Перечисления.Scan_ТипыЗаказовНаЗавод.FirmOrderUrgent);
	
	Возврат МассивТиповЗаказаFirm;
		
КонецФункции //rarus vikhle 03.09.2021 mt 18212 ---	

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
//rarus vikhle 13.09.2021 АПК ---
